EDT/УТ/src/Documents/мгДепримирование/мгДепримирование.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>мгДепримирование</name>
  <registerRecords>AccumulationRegister.мгЗарплатаУдержания</registerRecords>
  <attributes>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Данные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.новаЭкспедиторы</types>
        <types>CatalogRef.новаВодители</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

EDT/УТ/src/AccumulationRegisters/мгЗарплатаУдержания/мгЗарплатаУдержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>мгЗарплатаУдержания</name>
  <resources>
    <name>Тариф</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Терминал</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидУдержания</name>
    <type>
      <types>CatalogRef.мгНачисленияУдержания</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
      <types>CatalogRef.новаВодители</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

EDT/УТ/src/Documents/мгДепримирование/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр мгУчетЗарплаты 
	//Движения.мгУчетЗарплаты.Записывать = Истина;
	//Движения.мгУчетЗарплаты.Очистить();
	//Для Каждого ТекСтрокаДанные Из Данные Цикл
	//	Движение = Движения.мгУчетЗарплаты.Добавить();
	//	Движение.Период = ПериодРегистрации;
	//	Движение.Организация = Организация;
	//	Движение.Терминал = Терминал;
	//	Движение.НачислениеУдержание = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.НачислениеСдельнойОплаты");
	//	Движение.Сотрудник = ТекСтрокаДанные.Сотрудник;
	//	Движение.Сумма = ТекСтрокаДанные.СуммаОплаты;
	//КонецЦикла;

	Движения.мгЗарплатаУдержания.Записывать = Истина;
	Движения.мгЗарплатаУдержания.Очистить();
	Для каждого ТекСтрокаДанные Из Данные Цикл
		Движение = Движения.мгЗарплатаУдержания.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = ПериодРегистрации;
		Движение.Организация = ТекСтрокаДанные.Организация;
		Движение.Терминал = Терминал;
		Движение.ВидУдержания = ПредопределенноеЗначение("Справочник.мгНачисленияУдержания.Депримирование");
		Движение.Сотрудник = ТекСтрокаДанные.Сотрудник;
		Движение.Тариф = ТекСтрокаДанные.Сумма;
	КонецЦикла;

КонецПроцедуры
